app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."name" = ? LIMIT 1  [["name", "Cloud_9"]]
---
  def show
    @teamName = Team.find_by_name(params[:name])